cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF52xM.xml
        <!-- REGISTER "CSIO_TDR" -->
        <register>
          <name>CSIO_TDR</name>
          <description>Transmit Data Register</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x01FF</resetValue>
          <resetMask>0x01FF</resetMask>
        </register>
        <!-- REGISTER "CSIO_BGR" -->
        <register>
          <name>CSIO_BGR</name>
          <description>Baud Rate Generator Registers</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BGR1" -->
            <field>
              <name>BGR1</name>
              <description>Baud Rate Generator Registers 1</description>
              <lsb>8</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BGR0" -->
            <field>
              <name>BGR0</name>
              <description>Baud Rate Generator Registers 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_FCR1" -->
        <register>
          <name>CSIO_FCR1</name>
          <description>FIFO Control Register 1</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x15</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x04</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLSTE" -->
            <field>
              <name>FLSTE</name>
              <description>Re-transmission data lost detect enable bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRIIE" -->
            <field>
              <name>FRIIE</name>
              <description>Received FIFO idle detection enable bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FDRQ" -->
            <field>
              <name>FDRQ</name>
              <description>Transmit FIFO data request bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTIE" -->
            <field>
              <name>FTIE</name>
              <description>Transmit FIFO interrupt enable bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSEL" -->
            <field>
              <name>FSEL</name>
              <description>FIFO select bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_FCR0" -->
        <register>
          <name>CSIO_FCR0</name>
          <description>FIFO Control Register 0</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLST" -->
            <field>
              <name>FLST</name>
              <description>FIFO re-transmit data lost flag bit </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FLD" -->
            <field>
              <name>FLD</name>
              <description>FIFO pointer reload bit </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSET" -->
            <field>
              <name>FSET</name>
              <description>FIFO pointer save bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL2" -->
            <field>
              <name>FCL2</name>
              <description>FIFO2 reset bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL1" -->
            <field>
              <name>FCL1</name>
              <description>FIFO1 reset bit </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE2" -->
            <field>
              <name>FE2</name>
              <description>FIFO2 operation enable bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE1" -->
            <field>
              <name>FE1</name>
              <description>FIFO1 operation enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_FBYTE1" -->
        <register>
          <name>CSIO_FBYTE1</name>
          <description>FIFO Byte Register 1</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "CSIO_FBYTE2" -->
        <register>
          <name>CSIO_FBYTE2</name>
          <description>FIFO Byte Register 2</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LIN_SCR" -->
        <register>
          <name>LIN_SCR</name>
          <description>Serial Control Register</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCL" -->
            <field>
              <name>UPCL</name>
              <description>Programmable clear bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MS" -->
            <field>
              <name>MS</name>
              <description>Master/Slave function select bit </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBR" -->
            <field>
              <name>LBR</name>
              <description>LIN Break Field setting bit (valid in master mode only) </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RIE" -->
            <field>
              <name>RIE</name>
              <description>Received interrupt enable bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE" -->
            <field>
              <name>TIE</name>
              <description>Transmit interrupt enable bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TBIE" -->
            <field>
              <name>TBIE</name>
              <description>Transmit bus idle interrupt enable bit </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXE" -->
            <field>
              <name>RXE</name>
              <description>Data reception enable bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXE" -->
            <field>
              <name>TXE</name>
              <description>Data transmission enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_SMR" -->
        <register>
          <name>LIN_SMR</name>
          <description>Serial Mode Register</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xF9</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MD" -->
            <field>
              <name>MD</name>
              <description>Operation mode setting bits </description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUCR" -->
            <field>
              <name>WUCR</name>
              <description>Wake-up control bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SBL" -->
            <field>
              <name>SBL</name>
              <description>Stop bit length select bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOE" -->
            <field>
              <name>SOE</name>
              <description>Serial data output enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_SSR" -->
        <register>
          <name>LIN_SSR</name>
          <description>Serial Status Register</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x03</resetValue>
          <resetMask>0xBF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REC" -->
            <field>
              <name>REC</name>
              <description>Received Error flag clear bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBD" -->
            <field>
              <name>LBD</name>
              <description>LIN Break field detection flag bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRE" -->
            <field>
              <name>FRE</name>
              <description>Framing error flag bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ORE" -->
            <field>
              <name>ORE</name>
              <description>Overrun error flag bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDRF" -->
            <field>
              <name>RDRF</name>
              <description>Received data full flag bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TDRE" -->
            <field>
              <name>TDRE</name>
              <description>Transmit data empty flag bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TBI" -->
            <field>
              <name>TBI</name>
              <description>Transmit bus idle flag bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_ESCR" -->
        <register>
          <name>LIN_ESCR</name>
          <description>Extended Communication Control Register</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xDF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ESBL" -->
            <field>
              <name>ESBL</name>
              <description>Extended stop bit length select bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBIE" -->
            <field>
              <name>LBIE</name>
              <description>LIN Break field detect interrupt enable bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBL" -->
            <field>
              <name>LBL</name>
              <description>LIN Break field length select bits (valid in master mode only) </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DEL" -->
            <field>
              <name>DEL</name>
              <description>LIN Break delimiter length select bits (valid in master mode only) </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_RDR" -->
        <register>
          <name>LIN_RDR</name>
          <description>Received Data Register</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
        </register>
